"[\n    {\n        \"question\": \"What are the conditions to join the 'solarathon' mentorship program?\",\n        \"answer\": \"The conditions to join the 'solarathon' mentorship program can be found at https://docs.google.com/forms/d/e/1FAIpQLSfiQj3rFs3T5saWhhpGOHh-llLlD62g8zj76nIpoPY0NLky9Q/viewform\",\n        \"topic\": \"solarathon mentorship program\",\n        \"integrations\": [],\n        \"category\": \"Programs\"\n    },\n    {\n        \"question\": \"What are the benefits of using Solara for web app development?\",\n        \"answer\": \"Solara offers better state management and developer experience for more complex apps compared to other frameworks like Streamlit.\",\n        \"topic\": \"Solara framework\",\n        \"integrations\": [\"Python\"],\n        \"category\": \"Web Development\"\n    },\n    {\n        \"question\": \"How can I create a date range input in Solara?\",\n        \"answer\": \"To create a date range input in Solara, you can refer to the documentation or ask for assistance from the Solara community.\",\n        \"topic\": \"Date range input\",\n        \"integrations\": [\"Solara\"],\n        \"category\": \"Form Inputs\"\n    },\n    {\n        \"question\": \"Is there a way to interact with a matplotlib voxel graph using an ipython widgets package?\",\n        \"answer\": \"You can try using ipyvuetify or vanilla ipython widgets to interact with a matplotlib voxel graph. You may need to create a custom Solara component for this functionality.\",\n        \"topic\": \"Interacting with matplotlib voxel graph\",\n        \"integrations\": [\"ipyvuetify\", \"ipywidgets\"],\n        \"category\": \"Data Visualization\"\n    },\n    {\n        \"question\": \"How can I force the right-most columns of a DataFrame to render the hover box inside the bounds?\",\n        \"answer\": \"To force the right-most columns of a DataFrame to render the hover box inside the bounds, you can use the css 'style' argument or adjust the width of the DataFrame component.\",\n        \"topic\": \"Rendering hover box in DataFrame\",\n        \"integrations\": [\"Solara\"],\n        \"category\": \"Data Visualization\"\n    },\n    {\n        \"question\": \"How can I use solara.use_thread with a function that takes kwargs?\",\n        \"answer\": \"You can use a lambda function to pass kwargs to solara.use_thread. This should work well enough, but let us know if there is a better way.\",\n        \"topic\": \"Using solara.use_thread with kwargs\",\n        \"integrations\": [\"Solara\"],\n        \"category\": \"Threading\"\n    },\n    {\n        \"question\": \"Is there a way to make the Sidebar closed/collapsed by default in Solara?\",\n        \"answer\": \"Yes, you can override the default for the appLayout using a custom Layout component in Solara.\",\n        \"topic\": \"Sidebar in Solara\",\n        \"integrations\": [\"Solara\"],\n        \"category\": \"Layout\"\n    },\n    {\n        \"question\": \"What are the differences between Solara and Reflex (pynecone)?\",\n        \"answer\": \"Solara works entirely in Python and supports Jupyter notebook, while Reflex uses nextjs and may not have the same level of state management as Solara. It would be best to compare the documentation and features of both frameworks to determine which one suits your needs.\",\n        \"topic\": \"Differences between Solara and Reflex\",\n        \"integrations\": [\"Solara\", \"Reflex\"],\n        \"category\": \"Framework Comparison\"\n    },\n    {\n        \"question\": \"Why does the layout break when using fastapi with Solara version 1.22?\",\n        \"answer\": \"There seems to be an issue with fastapi and Solara version 1.22. Downgrading to Solara version 1.21 should resolve the layout problem. You can also try using solara run instead of fastapi to see if the formatting is correct.\",\n        \"topic\": \"Layout issue with fastapi\",\n        \"integrations\": [\"Solara\", \"fastapi\"],\n        \"category\": \"Layout\"\n    }\n]"